# იმუშავეთ ლოგიკურ ოპერაციებზე: print ბრძანებას გადაეცით 2 ან 3 ბულეანი და ისინი ერთმანეთთან დააკავშირეთ ლოგიკური ოპერატორებით (or / and)
a=True
b=False
print(a and b)
print( a or b)
c=True
print(a and b and c)
print(a or b or c)

# print ბრძანების გამოყენებით ჩამოწერეთ 10 ისეთი მაგალითი, სადაც გაერთიანებული გექნებათ შედარების ოპერაციები და ლოგიკური ოპერაციები. კარგი იქნება ცვლადებსაც თუ გამოიყენებთ და მათში შეინახავთ ბულეანებს ან სხვა მონაცემთა ტიპებს
a=10
b=5
c=15
d=10
is_active=True
is_verified=False
print(a==b and is_active)
print(b<c or is_verified)
print(a!=b or is_verified)
print(c>a and b<=d)
print(a==b or (is_verified and is_active))


#5) თქვენი სიტყვებით ახსენით რა არის control flow და რამდენი ტექნიკა გააჩნია მას
# არის პროგრამირების კონცეფცია, რომელიც განსაზღვრავს, თუ როგორ მიმდინარეობს პროგრამის შესრულება. ანუ, ის ფიქსირდება, რა თანმიმდევრობით შესრულდება კოდი, მისი სხვადასხვა ბრძანებების მიხედვით.
#7) თქვენი სიტყვებით ახსენით რა არის ალგორითმი და დაწერეთ რამდენი წარმოდგენის გზა აქვს მას - representation ways of algorithms
# 7) ალგორითმი არის ნაბიჯ-ნაბიჯ წესი ან პროცედურა, რომელიც გამოიყენება კონკრეტული პრობლემის ამოსაყვანად ან ამოხსნისთვის.