# intg.არის მონაცემი რომელშც მხოლოდ მთელი რიცხვების გამოყენება შეიძლება და მათზე შეგვიძლია მათემატიკური ოპერატორების გამოყენება
# str.მასში ნებისმიერი რამის ჩაწერის შემდგეგ კომპიუტერი მას აღიქვამს როგორც ტექსტს

# / და % შორის ის განსხვავებაა რომ, /-ის დროს არ გვაქვს ნაშთი და ყოველთვის ვიღევბთ float,ხოლო %-ის დროს გვაქვს ნაშთი.

print(5+5)
print(2+2)
print(1+3)
print(5-1)
print(5-2)
print(8-3)
print(5*5)
print(3*3)
print(2*9)
print(10/2)
print(4/2)
print(6/3)
print(10%2)
print(5%3)
print(10%5)
print(2**2)
print(5**3)
print(7**8)
 
# 8) შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს. შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ წინა ცვლადის ტემპერატურა ფარენჰეიტში რამდენი იქნება
celsius=40
fahrenheit= int((40*9/5)+32)
print(fahrenheit)

age1=15
age2=17
age3=40
age4=49

new_age1=age1+ 20
new_age2=age2+ 20
new_age=age3+ 20
new_age=age4+20
print(new_age1)